#### Terraform Prod Format and Style 🖌 `success`
#### Terraform Prod Initialization ⚙️ `success`
#### Terraform Prod Validation 🤖 `success`
<details><summary>Prod Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Prod Plan 📖 `success`

<details><summary>Show Prod Plan</summary>

```

terraform
data.databricks_current_user.service_principal: Reading...
data.databricks_current_user.service_principal: Read complete after 1s [id=7174275137976729]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_job.batch_inference_job will be created
  + resource "databricks_job" "batch_inference_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-nuwan-mlops-stacks-test-batch-inference-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/nuwan-db/nuwan-mlops-stacks-test"
        }

      + new_cluster {
          + custom_tags                  = {
              + "clusterSource" = "mlops-stack/0.0"
            }
          + data_security_mode           = "SINGLE_USER"
          + driver_instance_pool_id      = (known after apply)
          + driver_node_type_id          = (known after apply)
          + enable_elastic_disk          = (known after apply)
          + enable_local_disk_encryption = (known after apply)
          + node_type_id                 = "Standard_D3_v2"
          + num_workers                  = 3
          + single_user_name             = "fde5c3b8-bb92-434e-a996-7d4a765271d9"
          + spark_version                = "11.0.x-cpu-ml-scala2.12"
        }

      + notebook_task {
          + base_parameters = {
              + "env"               = "prod"
              + "input_table_name"  = ""
              + "output_table_name" = "nuwanmlopsstackstest_predictions"
            }
          + notebook_path   = "nuwan-mlops-stacks-test/deployment/batch_inference/notebooks/BatchInference"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 11 * * ?"
          + timezone_id            = "UTC"
        }
    }

  # databricks_job.model_training_job will be created
  + resource "databricks_job" "model_training_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-nuwan-mlops-stacks-test-model-training-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/nuwan-db/nuwan-mlops-stacks-test"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "Train"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + data_security_mode           = "SINGLE_USER"
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + single_user_name             = "fde5c3b8-bb92-434e-a996-7d4a765271d9"
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "prod"
                }
              + notebook_path   = "nuwan-mlops-stacks-test/training/notebooks/Train"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "ModelValidation"

          + depends_on {
              + task_key = "Train"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "custom_metrics_loader_function"        = "custom_metrics"
                  + "enable_baseline_comparison"            = "true"
                  + "env"                                   = "prod"
                  + "evaluator_config_loader_function"      = "evaluator_config"
                  + "experiment_name"                       = "/nuwan-mlops-stacks-test-prod/prod-nuwan-mlops-stacks-test-experiment"
                  + "run_mode"                              = "disabled"
                  + "validation_input"                      = "SELECT * FROM delta.`dbfs:/databricks-datasets/nyctaxi-with-zipcodes/subsampled`"
                  + "validation_thresholds_loader_function" = "validation_thresholds"
                }
              + notebook_path   = "nuwan-mlops-stacks-test/validation/notebooks/ModelValidation"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "TriggerModelDeploy"

          + depends_on {
              + task_key = "ModelValidation"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "prod"
                }
              + notebook_path   = "nuwan-mlops-stacks-test/deployment/model_deployment/notebooks/TriggerModelDeploy"
            }
        }
    }

  # databricks_mlflow_experiment.experiment will be created
  + resource "databricks_mlflow_experiment" "experiment" {
      + creation_time    = (known after apply)
      + description      = "MLflow Experiment used to track runs for nuwan-mlops-stacks-test project."
      + experiment_id    = (known after apply)
      + id               = (known after apply)
      + last_update_time = (known after apply)
      + lifecycle_stage  = (known after apply)
      + name             = "/nuwan-mlops-stacks-test-prod/prod-nuwan-mlops-stacks-test-experiment"
    }

  # databricks_mlflow_model.registered_model will be created
  + resource "databricks_mlflow_model" "registered_model" {
      + creation_timestamp     = (known after apply)
      + description            = (known after apply)
      + id                     = (known after apply)
      + last_updated_timestamp = (known after apply)
      + name                   = "prod-nuwan-mlops-stacks-test-model"
      + registered_model_id    = (known after apply)
      + user_id                = (known after apply)
    }

  # databricks_permissions.batch_job_permissions will be created
  + resource "databricks_permissions" "batch_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

  # databricks_permissions.mlflow_experiment_permissions will be created
  + resource "databricks_permissions" "mlflow_experiment_permissions" {
      + experiment_id = (known after apply)
      + id            = (known after apply)
      + object_type   = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.mlflow_model_permissions will be created
  + resource "databricks_permissions" "mlflow_model_permissions" {
      + id                  = (known after apply)
      + object_type         = (known after apply)
      + registered_model_id = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.training_job_permissions will be created
  + resource "databricks_permissions" "training_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + nuwan-mlops-stacks-test_batch_inference_job_id = (known after apply)
  + nuwan-mlops-stacks-test_experiment_id          = (known after apply)
  + nuwan-mlops-stacks-test_experiment_name        = "/nuwan-mlops-stacks-test-prod/prod-nuwan-mlops-stacks-test-experiment"
  + nuwan-mlops-stacks-test_model_name             = "prod-nuwan-mlops-stacks-test-model"
  + nuwan-mlops-stacks-test_training_job_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>